In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Practice.csv')
df

   ID    Name Department  Salary  Experience(in years)
0   1   Aditi         HR   40000                     2
1   2   Rohan         IT   55000                     4
2   3   Priya    Finance   52000                     3
3   4    Aman         IT   60000                     5
4   5  Simran  Marketing   45000                     2
5   6   Karan    Finance   58000                     4
6   7    Neha         HR   42000                     1
7   8   Vikas         IT   67000                     6
8   9    Riya  Marketing   47000                     3
9  10   Arjun    Finance   61000                     5

## 1. Print first 5 rows

In [3]:
df.head()

   ID    Name Department  Salary  Experience(in years)
0   1   Aditi         HR   40000                     2
1   2   Rohan         IT   55000                     4
2   3   Priya    Finance   52000                     3
3   4    Aman         IT   60000                     5
4   5  Simran  Marketing   45000                     2

## 2. Show total number of rows and columns

In [4]:
df.shape

(10, 5)


## 3. Display only Name and Salary columns

In [5]:
df[["Name", "Salary"]]

     Name  Salary
0   Aditi   40000
1   Rohan   55000
2   Priya   52000
3    Aman   60000
4  Simran   45000
5   Karan   58000
6    Neha   42000
7   Vikas   67000
8    Riya   47000
9   Arjun   61000

## 4. Find the average salary

In [6]:
df["Salary"].mean()

np.float64(52700.0)

## 5. Get all records where department is "IT"

In [7]:
df[df['Department']=='IT']

   ID   Name Department  Salary  Experience(in years)
1   2  Rohan         IT   55000                     4
3   4   Aman         IT   60000                     5
7   8  Vikas         IT   67000                     6

# 6. Sort the data by salary in descending order

In [8]:
df.sort_values(by="Salary",ascending=False)

   ID    Name Department  Salary  Experience(in years)
7   8   Vikas         IT   67000                     6
9  10   Arjun    Finance   61000                     5
3   4    Aman         IT   60000                     5
5   6   Karan    Finance   58000                     4
1   2   Rohan         IT   55000                     4
2   3   Priya    Finance   52000                     3
8   9    Riya  Marketing   47000                     3
4   5  Simran  Marketing   45000                     2
6   7    Neha         HR   42000                     1
0   1   Aditi         HR   40000                     2

## 7. Find min and max salary

In [9]:
df["Salary"].min(),df["Salary"].max()

(np.int64(40000), np.int64(67000))

# 8. Count how many employees are in each department

In [10]:
df["Department"].value_counts()

Department
IT           3
Finance      3
HR           2
Marketing    2
Name: count, dtype: int64

## 9. Filter employees with experience > 3 years

In [11]:
df[df['Experience(in years)']>3]

   ID   Name Department  Salary  Experience(in years)
1   2  Rohan         IT   55000                     4
3   4   Aman         IT   60000                     5
5   6  Karan    Finance   58000                     4
7   8  Vikas         IT   67000                     6
9  10  Arjun    Finance   61000                     5

## 10. Add a Bonus column (10% of salary)

In [12]:
df["Bonus"] = df["Salary"] * 0.10
df

   ID    Name Department  Salary  Experience(in years)   Bonus
0   1   Aditi         HR   40000                     2  4000.0
1   2   Rohan         IT   55000                     4  5500.0
2   3   Priya    Finance   52000                     3  5200.0
3   4    Aman         IT   60000                     5  6000.0
4   5  Simran  Marketing   45000                     2  4500.0
5   6   Karan    Finance   58000                     4  5800.0
6   7    Neha         HR   42000                     1  4200.0
7   8   Vikas         IT   67000                     6  6700.0
8   9    Riya  Marketing   47000                     3  4700.0
9  10   Arjun    Finance   61000                     5  6100.0

## 11. Group by Department and find average salary

In [13]:
df.groupby('Department')['Salary'].mean()

Department
Finance      57000.000000
HR           41000.000000
IT           60666.666667
Marketing    46000.000000
Name: Salary, dtype: float64

In [ ]:
print(df['Salary'].memory_usage(deep=True))
df['Salary'] = df['Salary'].astype('category')
print(f"Optimized 'grade' dtype: {df['Salary'].dtype}")
print(df['Salary'].memory_usage(deep=True))

522
Optimized 'grade' dtype: category
522